app/controllers/likes_controller.rb

  def create
    @user = User.find(params[:like][:liking_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 ORDER BY `users`.`id` ASC LIMIT 1

  def destroy
    @user = Like.find(params[:id]).liking
---
SELECT  `likes`.* FROM `likes` WHERE `likes`.`id` = 1 LIMIT 1