app/controllers/profiles_controller.rb

  def show
    @user = User.find_by(id: current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 ORDER BY `users`.`id` ASC LIMIT 1

  def edit
    @user = User.find_by(id: current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 ORDER BY `users`.`id` ASC LIMIT 1