app/controllers/profile_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @user = User.find_by(id: current_user.id)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 12 ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
    @user = User.find_by(id: current_user.id)

UPDATE `profiles` SET `height` = 186, `bodytype` = '', `blood` = '', `birthplace` = '', `job` = '', `education` = '', `age` = '', `brother` = '', `language` = '', `wantchild` = '', `household` = '', `meet` = '', `datecost` = '', `personality` = '', `sociability` = '', `updated_at` = '2017-07-25 10:53:27' WHERE `profiles`.`id` = 5
UPDATE `users` SET `height` = 184, `bodytype` = '太っている', `blood` = 'B', `live` = '神奈川', `birthplace` = '滋賀', `job` = '製造', `education` = '大学卒', `income` = '二百円', `tobacco` = '吸わない', `nickname` = 'ぽっぽ', `age` = 27, `brother` = 'いる', `country` = '日本', `language` = '日本', `marital` = 'なし', `children` = 'なし', `marriagedesire` = 'ある', `wantchild` = '欲しい', `household` = 'できるだけ参加', `meet` = '気が合えば', `datecost` = '男性が持つ', `personality` = '飛行・ノーマル', `sociability` = 'ある', `housemate` = 'いない', `holiday` = '土日祝', `liquor` = '好き', `hobby` = 'ボドゲ' WHERE `users`.`id` = 14
---
  def update
    @user = current_user.update(profile_params)