app/controllers/profile_controller.rb

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` IS NULL LIMIT 1
---
  def index
    @profiles = Profile.find(params[:user_id])

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 12 LIMIT 1
---
  def edit
    @profiles = Profile.find(params[:user_id])