app/controllers/search_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`sexes` = 2 LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `users` WHERE `users`.`sexes` = 2
---
  def index
    @profile = User.find_by(id: current_user.id)
    if current_user.sexes == 1
      @searches = User.where(sexes: 2).page(params[:page])