app/controllers/users/omniauth_callbacks_controller.rb

  def facebook
    @user = User.find_for_oauth(request.env['omniauth.auth'])
    @profile = Profile.create(user_id: @user.id)
---
INSERT INTO `profiles` (`created_at`, `updated_at`, `user_id`) VALUES ('2017-07-20 11:54:56', '2017-07-20 11:54:56', 6)
INSERT INTO `users` (`email`, `encrypted_password`, `provider`, `uid`, `image`) VALUES ('1081927028604641-facebook@example.com', '$2a$11$BxitVsaLuBes9ufRS5jD8OZ5m0QOIt2OksuBWfa1rQ49vNdzxhuYO', 'facebook', '1081927028604641', 'http://graph.facebook.com/v2.6/1081927028604641/picture')